#overlays.py
import utilities as pdf


date = [
    ["October 2004", 110, 751, 9]
]

school_data = [
    ["School name",65,690,12],
    ["Bank name",65,660,12],
    ["Gram Panchayat",308,690,12],
    ["Khata Syankha",265,660,12],
    ["IFSC code",405,660,12],
    ["Block",440,690,12],
    ["1 to 5",285,640,12],
    ["6 to 8",405,640,12],
    ["mobile1",210,622,12],
    ["whatsapp",415,622,12],
    ["MDM",457,718,12],
    # Add more overlays as needed
]
#this function will add the text to the MDM pdf and give an output.pdf


'''table = [
    ["s68",350,550, 12],
    ["s15",157,550,12],
    ["w15",210,550,12],
    ["r15",260,550,12],
    ["m15",305,550,12],
    ["w68",405,550,12],
    ["r68",459,550,12],
    ["m68",507,550,12], #15 difference per row
    # Add more overlays as needed
]
#this will add more data to the output.pdf created by the function above


page2 = [
    ["15w3", 134,580, 12],
    ["15r3",134,567, 12],
    ["68w3",134,554,12],
    ["68r3",134,539,12],
    ["4",167,580,12],
    ["5",167,565,12],
    ["6",167,552,12],
    ["7",167,538,12],
    ["t1",134,525,12],
    ["t2",167,525,12],
    ["p1",134,513,12],
    ["p2",167,513,12],

    ["5*",208,580,12],
    ["6*",248,580,12],
    ["7*",283,580,12],
    ["8*",343,580,12],
    ["9*",393,580,12],
    ["10*",440,580,12],
    ["11*",475,580,12],
    ["12*",515,580,12],
    # Add more overlays as needed
]

page22 = [
    ["p1*",65,710,12],
    ["p3*",169,710,12],
    ["p4*",200,710,12],
    ["p6*",275,710,12],
    ["p7*",300,710,12],
    ["p9*",390,710,12],
    ["p10*",430,710,12],
    ["p12*",520,710,12],
    ["p13*",65,661,12],
    ["p15*",169,661,12],
    ["p16*",243,661,12],
    ["p18*",335,661,12],
    ["p19*",442,661,12],
    #. माह के  दौरान ®ेणीवार लाभािÆवत छाý / छाýाओं / कु क कम हेÐपरŌ कì सं ́या 
    ["sc",65,407,12],
    ["st",98,407,12],
    ["oth",136,407,12],
    ["tot",169,407,12],
    ["sc*",208,407,12],
    ["st*",248,407,12],
    ["oth*",294,407,12],
    ["tot*",355,407,12],
    ["cook1",475,435,12],
    ["cook2",475,421,12],
    ["cook3",475,407,12],
    # Add more overlays as needed
    #कु क कम हेÐपर कì सूचना
    ["x",98,369,12],
    ["y",250,369,12],
    ["z",398,369,12],
    ["x1",98,355,12],
    ["y1",250,355,12],
    ["z1",398,355,12],
    #माह के  दौरान िकये गये िनरी±ण (सं ́या म¤ दशाªय¤)
    ["a3",208,250,12],
    ["a1",208,279,12],
    ["a2",208,265,12],
    ["a4",208,225,12],
    ["a5",208,210,12],
    ["mobile no",445,160,12],
]'''

def printSchoolData():
    pdf.add_text(pdf_path="Cleaned-MDM-Blank-UC.pdf")
    pdf.add_text(date,alignment='right')
    pdf.add_text(school_data)

'''pdf.add_text(table)
pdf.add_text(page2, page_number=2)
pdf.add_text(page22, page_number=2)'''
